        01  IN-PUT.
            05 ACCOUNT-IN.
              07 ACTI-ACCOUNT-ID                  PIC X(11).
              07 FILLER                             PIC X(237).