      *****************************************************************
      * DPOLCS2.cpy - DELETE INSURANCE POLICY FOR CICS AND DB2
      *****************************************************************
           03 OUT-PUT.
             05 RT-MSG                           PIC X(60).