      *****************************************************************
      * LPOLCS2.cpy - LIST INSURANCE POLICIES FOR CICS AND DB2
      *****************************************************************
           03 IN-PUT.
            04 ONECHAR                      PIC X(1) VALUE 'A'.	
           03 FILLER                          PIC X(1770).	   
