      *****************************************************************
      * DACTIM8.cpy - DELETE ACCOUNT - IMS & DB2 with COMP-3
      *****************************************************************
           02 IN-PUT.                
             05 ACTI-ACCOUNT-ID                PIC X(11).
