      *****************************************************************
      * LACTIM8.cpy - LIST ALL ACCOUNT - IMS & DB2 with COMP-3
      *****************************************************************
          02 IN-PUT.
            05 ONECHAR                    PIC X(1) VALUE 'A'.
