      *****************************************************************
      * RACTIM8.cpy - RESET ACCOUNT - IMS & DB2
      *****************************************************************

           02 OUT-PUT.
             03 CONV-TRAN                    PIC X(8). 
             03 RT-MSG                          PIC X(60).

			