      *****************************************************************
      * DPOLCS2.cpy - DELETE INSURANCE POLICY FOR CICS AND DB2
      *****************************************************************
           03 IN-PUT.
             05 ACTI-POLICY-NUM                  PIC X(11).
           03 FILLER                               PIC X(60).