      *****************************************************************
      * RPOLCS2.cpy - RESET POLICIES FOR CICS AND DB2
      *               DELETE CURRENT POLICIES, AND ADD NEW ONES
      *****************************************************************
          03  OUT-PUT.
           04 RT-MSG                           PIC X(60).
          03  FILLER                             PIC X(1550).
